app/controllers/albums_controller.rb

  def show
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)

  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO `albums` (`name`, `updated_at`, `created_at`) VALUES('Album #1', '2009-03-05 05:01:33', '2009-03-05 05:01:33')