app/controllers/events_controller.rb

  def index
    @selected_date = (params[:year] and params[:month] and params[:day]) ? Date.new(params[:year].to_i,params[:month].to_i,params[:day].to_i) : false
    @events = @selected_date ? Event.find_all_by_date(@selected_date) :  Event.find(:all)
    @events_by_month = @events.group_by{|e| e.when.month}
---
SELECT * FROM `events`

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`name`, `updated_at`, `description`, `when`, `created_at`) VALUES('Event1', '2009-02-23 05:14:08', 'today', '2009-02-23 00:00:00', '2009-02-23 05:14:08')

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)

  def update
    @event = Event.find(params[:id])
    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)
UPDATE `events` SET `description` = 'This is no longer today', `updated_at` = '2009-02-25 23:09:29' WHERE `id` = 1