app/controllers/members_controller.rb

  def index
    @members = Member.scoped(:order => "fname, lname")
    unless @current_member
      @members = @members.find(:all, :conditions => {:is_alumni => false})
---
SELECT * FROM `members` WHERE (`members`.`id` = 3)

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)

  def edit
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 5)

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO `members` (`name`, `degree`, `updated_at`, `knickname`, `favorite_quote`, `password_salt`, `is_phi`, `password_hash`, `grad_year`, `photo_id`, `position`, `created_at`) VALUES('Chris Proulx', NULL, '2009-03-05 04:48:51', 'pudgy', NULL, 'SHunyP8H', 0, '3c2f4542288eb9e6d229010947b59ab2354ada9c', NULL, 3, 'Alpha Phi', '2009-03-05 04:48:51')

  def update
    @member = Member.find(params[:id])
    @links = params[:links]
    if not @links.empty?
      urls = Link.find_all_by_member_id(@member.id).collect(&:url)
      @links.each{|link|
        begin
          if urls.include?(link.url)
            next
          else
            temp = Link.new(:my_type => link['mytype'], :url => link['url'], :member_id => @member.id)
            temp.save
          end
        rescue
          flash[:notice] = 'Error creating link. Please try again.'
        end
      }
    end
    respond_to do |format|
      if @member.update_attributes(params[:member])
---
SELECT * FROM `members` WHERE (`members`.`id` = 3)
UPDATE `members` SET `position` = 'Old Guy', `photo_id` = 1, `password_hash` = 'cd0aec0afc421a04b3d6863fbd4f625c0a062275', `knickname` = '', `updated_at` = '2009-03-05 04:57:52', `password_salt` = 'gKa374ON' WHERE `id` = 1

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)
DELETE FROM `members` WHERE `id` = 1