app/controllers/wiki_pages_controller.rb

  def create
    @wiki_page = WikiPage.new(params[:wiki_page])
    @wiki_page.author = @current_member

    if @wiki_page.save
---
INSERT INTO `wiki_pages` (`name`, `last_edit_by_id`, `updated_at`, `content`, `author_id`, `created_at`) VALUES('Table of Contents', 3, '2009-02-25 23:01:39', 'This is the first article in the wiki', 3, '2009-02-25 23:01:39')

  def show
    @wiki_page = WikiPage.find(params[:id])

    @previous_page = WikiPage.first
---
SELECT * FROM `wiki_pages` WHERE (`wiki_pages`.`id` = 1)
SELECT * FROM `wiki_pages` LIMIT 1